[Killed] StringLiteral
main/components/Twilio/TwilioErrorTable.js:39:20
     );
     // Stryker restore  all
 
-    const testid = "PagedTwilioErrorTable";
+    const testid = "";
 
     const previousPageCallback = () => {
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PagedTwilioErrorTable-cell-row-0-col-id"]

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] ObjectLiteral
main/components/Twilio/TwilioErrorTable.js:54:9
     }
 
     const columns = [
-        {
-            Header: 'Id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
+        {},
         {
             Header: 'Timestamp',
killedBy: TwilioErrorTable tests Renders correctly for empty
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Twilio/TwilioErrorTable.js:61:19
         {
             Header: 'Timestamp',
             accessor: 'timestamp',
-            Cell: ({ value }) => formatTimestamp(value),
+            Cell: () => undefined,
         },
         {
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: TestingLibraryElementError: Unable to find an element with the text: Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Twilio/TwilioErrorTable.js:64:21
             Cell: ({ value }) => formatTimestamp(value),
         },
         {
-            Header: 'Error Message',
+            Header: "",
             accessor: 'errorMessage'
         },
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: TestingLibraryElementError: Unable to find an element with the text: Error Message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] StringLiteral
main/components/Twilio/TwilioErrorTable.js:65:23
         },
         {
             Header: 'Error Message',
-            accessor: 'errorMessage'
+            accessor: ""
         },
         {
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PagedTwilioErrorTable-cell-row-0-col-errorMessage"]

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] ObjectLiteral
main/components/Twilio/TwilioErrorTable.js:67:9
             Header: 'Error Message',
             accessor: 'errorMessage'
         },
-        {
-            Header: 'Content',
-            accessor: 'content'
-        },
+        {},
         {
             Header: 'Receiver',
killedBy: TwilioErrorTable tests Renders correctly for empty
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Twilio/TwilioErrorTable.js:68:21
             accessor: 'errorMessage'
         },
         {
-            Header: 'Content',
+            Header: "",
             accessor: 'content'
         },
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: TestingLibraryElementError: Unable to find an element with the text: Content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] StringLiteral
main/components/Twilio/TwilioErrorTable.js:69:23
         },
         {
             Header: 'Content',
-            accessor: 'content'
+            accessor: ""
         },
         {
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PagedTwilioErrorTable-cell-row-0-col-content"]

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] StringLiteral
main/components/Twilio/TwilioErrorTable.js:73:23
         },
         {
             Header: 'Receiver',
-            accessor: 'receiver'
+            accessor: ""
         },
         {
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PagedTwilioErrorTable-cell-row-0-col-receiver"]

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] StringLiteral
main/components/Twilio/TwilioErrorTable.js:76:21
             accessor: 'receiver'
         },
         {
-            Header: 'Sender',
+            Header: "",
             accessor: 'sender'
         },
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: TestingLibraryElementError: Unable to find an element with the text: Sender. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] StringLiteral
main/components/Twilio/TwilioErrorTable.js:77:23
         },
         {
             Header: 'Sender',
-            accessor: 'sender'
+            accessor: ""
         },
     ];
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PagedTwilioErrorTable-cell-row-0-col-sender"]

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] ConditionalExpression
main/components/Twilio/TwilioErrorTable.js:84:106
     return (
         <>
             <p>Page: {selectedPage + 1}</p>
-            <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
+            <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ true}>Previous</Button>
             <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
             < OurTable
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: Error: expect(element).toBeEnabled()

Received element is not enabled:
  <button class="btn btn-primary" data-testid="PagedTwilioErrorTable-previous-button" disabled="" type="button" />

[Killed] ArithmeticOperator
main/components/Twilio/TwilioErrorTable.js:85:138
         <>
             <p>Page: {selectedPage + 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
-            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
+            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages + 1}>Next</Button>
             < OurTable
                 data={page.content}
killedBy: TwilioErrorTable tests renders correctly for 1 page
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="btn btn-primary" data-testid="PagedTwilioErrorTable-next-button" type="button" />
