[Killed] BlockStatement
main/components/Nav/AppNavbar.js:23:81
 }
 
 function createRideRequest(currentUser) {
-  if (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) {
-    return (<NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>)
-  } else {
+  if (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) {} else {
     return (<div data-testid="NO-appnavbar-ride-create-dropdown"></div>)
   }
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-ride-create-dropdown/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/twilioError">Chat Errors</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
+                    <NavDropdown.Item as={Link} to="/twilioError">Chat Errors</NavDropdown.Item>
+                  </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="nav-item dropdown" data-testid="appnavbar-admin-dropdown"><a aria-expanded="false" class="dropdown-toggle nav-link" href="#" id="appnavbar-admin-dropdown" role="button" tabindex="0">Admin</a></div> instead

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/twilioError">Chat Errors</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:100:17
                 )
               }
               {
-                hasChat(currentUser) && (
-                  <NavDropdown title="Chat" id="appnavbar-chat-dropdown" data-testid="appnavbar-chat-dropdown" >
-                    <NavDropdown.Item as={Link} to="/chat">Chat</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders chat link correctly for driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-chat-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:107:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <Nav.Link id ="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/driver">Drivers Page</Nav.Link>
-                )
+                hasRole(currentUser, "ROLE_DRIVER") || <Nav.Link id="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/driver">Drivers Page</Nav.Link>
               }
             </Nav>
killedBy: AppNavbar tests renders driver page link for driver
statusReason: Error: Unable to find an element with the text: /Drivers/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:107:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <Nav.Link id ="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/driver">Drivers Page</Nav.Link>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders driver page link for driver
statusReason: Error: Unable to find an element with the text: /Drivers/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
