[Killed] BooleanLiteral
src/main/pages/ProfilePage.js:15:30
 import parsePhoneNumber from 'libphonenumber-js';
 
 
-const ProfilePage = ({test = false}) => {
+const ProfilePage = ({test = true}) => {
     
 
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

<html>
  <head />
  <body

[Killed] BooleanLiteral
src/main/pages/ProfilePage.js:24:52
     const [phoneNumber, setPhoneNumber] = useState("");
     const [updatedPhoneNumber, setUpdatedPhoneNumber] = useState("");
     // Stryker restore all
-    const [whichNumber, setWhichNumber] = useState(false);
+    const [whichNumber, setWhichNumber] = useState(true);
 
 
killedBy: CellPhone tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: cell phone number: 111-111-1111. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
src/main/pages/ProfilePage.js:27:31
     const [whichNumber, setWhichNumber] = useState(false);
 
 
-    const handleClose = () => {
-        setShow(false);
-        // Stryker disable next-line all
-        setPhoneNumber("");
-    };
+    const handleClose = () => {};
 
     const handleShow = () => setShow(true);
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BooleanLiteral
src/main/pages/ProfilePage.js:33:38
         setPhoneNumber("");
     };
 
-    const handleShow = () => setShow(true);
+    const handleShow = () => setShow(false);
 
     const objectToAxiosParams = () => ({
killedBy: CellPhone tests on submit, makes request to backend
statusReason: TestingLibraryElementError: Unable to find an element with the text: Input phone number. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/ProfilePage.js:33:24
         setPhoneNumber("");
     };
 
-    const handleShow = () => setShow(true);
+    const handleShow = () => undefined;
 
     const objectToAxiosParams = () => ({
killedBy: CellPhone tests on submit, makes request to backend
statusReason: TestingLibraryElementError: Unable to find an element with the text: Input phone number. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/ProfilePage.js:35:33
 
     const handleShow = () => setShow(true);
 
-    const objectToAxiosParams = () => ({
-        url: "/api/userprofile/update-cellPhone",
-        method: "PUT",
-        params: {
-         cellPhone: parsePhoneNumber(phoneNumber).number
-        }
-      })
+    const objectToAxiosParams = () => undefined
 
       const onSuccess = () => {
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] ObjectLiteral
src/main/pages/ProfilePage.js:35:40
 
     const handleShow = () => setShow(true);
 
-    const objectToAxiosParams = () => ({
-        url: "/api/userprofile/update-cellPhone",
-        method: "PUT",
-        params: {
-         cellPhone: parsePhoneNumber(phoneNumber).number
-        }
-      })
+    const objectToAxiosParams = () => ({})
 
       const onSuccess = () => {
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BlockStatement
src/main/pages/ProfilePage.js:43:31
         }
       })
 
-      const onSuccess = () => {
-        toast(`Cell Phone number changed ${phoneNumber}`);
-        setUpdatedPhoneNumber(parsePhoneNumber(phoneNumber).number);
-        setWhichNumber(true);
-        handleClose();
-    };
+      const onSuccess = () => {};
     
     const mutation = useBackendMutation(
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BooleanLiteral
src/main/pages/ProfilePage.js:46:24
       const onSuccess = () => {
         toast(`Cell Phone number changed ${phoneNumber}`);
         setUpdatedPhoneNumber(parsePhoneNumber(phoneNumber).number);
-        setWhichNumber(true);
+        setWhichNumber(false);
         handleClose();
     };
killedBy: CellPhone tests on submit, makes request to backend
statusReason: TestingLibraryElementError: Unable to find an element with the text: cell phone number: +19876543210. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BlockStatement
src/main/pages/ProfilePage.js:58:39
     );
     
 
-    const onSubmit = async (event) => {
-      event.preventDefault();
-      const parsedPhoneNumber = parsePhoneNumber(phoneNumber);
-
-      // Stryker disable next-line all : would need to use real phonenumber for privacy reasons not implemented test for that case
-      if ((!parsedPhoneNumber || !parsedPhoneNumber.isValid()) && !test) {
-          toast("Invalid phone number format. Please enter a valid phone number.");
-          return;
-      }
-
-      mutation.mutate(phoneNumber);
-  };
+    const onSubmit = async (event) => {};
 
 
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BlockStatement
src/main/pages/ProfilePage.js:72:40
   };
 
 
-    const onChangePhoneNumber = (e) => {
-        const newPhoneNumber = e.target.value;
-        setPhoneNumber(newPhoneNumber);
-      };
+    const onChangePhoneNumber = (e) => {};
 
     
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] StringLiteral
src/main/pages/ProfilePage.js:101:38
                     <p className="lead text-muted">{email}</p>
         
                     
-                    <RoleBadge role={"ROLE_USER"} currentUser={currentUser}/>
+                    <RoleBadge role={""} currentUser={currentUser}/>
                     <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser}/>
                     <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser}/>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
