[Killed] BlockStatement
src/main/pages/TwilioErrorPage.js:5:31
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import PagedTwilioErrorTable from 'main/components/Twilio/TwilioErrorTable';
 
-const TwilioErrorPage = () => {
-    return (
-        <BasicLayout>
-        <div className="twilio-errors">
-            <h1>Twilio Errors</h1>
-            <PagedTwilioErrorTable />
-        </div>
-        </BasicLayout>
-    );
-}
+const TwilioErrorPage = () => {}
 
 export default TwilioErrorPage;
killedBy: TwilioErrorPage tests Renders Correctly
statusReason: Error: TwilioErrorPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
